In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
from datetime import datetime as dt
import plotly.express as px


%matplotlib inline

In [2]:
#Pulling in zillow inventory csv
inventory = pd.read_csv('../data/zillow_inventory.csv')

In [3]:
inventory.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2018-03-31,2018-04-30,2018-05-31,2018-06-30,2018-07-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,1424090.0,1502795.0,1594976.0,1663124.0,1711611.0,...,738696.0,671888.0,692258.0,739342.0,823214.0,907856.0,992241.0,1050164.0,1058568.0,1034548.0
1,394913,1,"New York, NY",msa,NY,73707.0,80345.0,85864.0,90067.0,91881.0,...,43468.0,39614.0,41249.0,44579.0,48962.0,52255.0,54874.0,55245.0,54335.0,51915.0
2,753899,2,"Los Angeles, CA",msa,CA,21998.0,23784.0,25605.0,27109.0,28811.0,...,13764.0,12851.0,14003.0,15277.0,16794.0,18264.0,20010.0,21199.0,21350.0,20723.0
3,394463,3,"Chicago, IL",msa,IL,38581.0,42253.0,45757.0,47492.0,48984.0,...,24881.0,21732.0,22202.0,23672.0,26136.0,28137.0,29939.0,30827.0,30449.0,29301.0
4,394514,4,"Dallas, TX",msa,TX,24043.0,25876.0,28225.0,30490.0,32408.0,...,15937.0,14301.0,14351.0,14544.0,15659.0,17345.0,19917.0,21753.0,22220.0,21699.0

In [4]:
#pulling in average list price csv
list_price = pd.read_csv('../data/zillow_list_and_sales_price.csv')

In [5]:
list_price.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2018-03-31,2018-04-30,2018-05-31,2018-06-30,2018-07-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,263267.0,271267.0,276300.0,279667.0,279967.0,...,331667.0,336667.0,349000.0,364967.0,379933.0,391267.0,397633.0,396000.0,392967.0,388300.0
1,394913,1,"New York, NY",msa,NY,503000.0,513000.0,521300.0,526300.0,528300.0,...,593333.0,604333.0,615667.0,631880.0,641880.0,648546.0,642333.0,634333.0,627667.0,632983.0
2,753899,2,"Los Angeles, CA",msa,CA,721333.0,735000.0,743333.0,750000.0,749667.0,...,866000.0,882623.0,905938.0,926238.0,942948.0,949967.0,949667.0,941333.0,932967.0,916633.0
3,394463,3,"Chicago, IL",msa,IL,284600.0,294600.0,300600.0,302267.0,301967.0,...,284966.0,287967.0,297667.0,309300.0,317967.0,323300.0,323983.0,320649.0,317316.0,313300.0
4,394514,4,"Dallas, TX",msa,TX,322997.0,328497.0,331797.0,332800.0,329502.0,...,381053.0,387632.0,394332.0,405998.0,418300.0,431633.0,438267.0,434967.0,428300.0,418333.0

In [6]:
#pulling in sales count csv
sales_count = pd.read_csv('../data/zillow_sales_count.csv')

In [7]:
sales_count.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2008-02-29,2008-03-31,2008-04-30,2008-05-31,2008-06-30,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,152555.0,182505.0,203819.0,222841.0,237188.0,...,301409.0,272483.0,364536.0,355886.0,378308.0,396505.0,339108.0,356134.0,326291.0,311761.0
1,394913,1,"New York, NY",msa,NY,7435.0,7995.0,8675.0,8925.0,9499.0,...,17074.0,13356.0,15221.0,13577.0,14188.0,15546.0,16409.0,17201.0,14690.0,12571.0
2,753899,2,"Los Angeles, CA",msa,CA,3263.0,3854.0,4684.0,5205.0,5323.0,...,6395.0,6269.0,9096.0,8740.0,8313.0,8113.0,6678.0,6935.0,6511.0,6113.0
3,394463,3,"Chicago, IL",msa,IL,3871.0,4661.0,5369.0,5308.0,6502.0,...,8668.0,6351.0,9873.0,10570.0,11352.0,12238.0,10545.0,10863.0,9770.0,8071.0
4,394514,4,"Dallas, TX",msa,TX,4496.0,5445.0,6209.0,6465.0,6668.0,...,6240.0,5906.0,7721.0,7364.0,8202.0,8311.0,7609.0,7851.0,6782.0,6505.0

In [8]:
#pulling sales counts for Atlanta
atl_sales_count = sales_count.loc[sales_count['RegionName']=='Atlanta, GA']
atl_sales_count

,RegionID,SizeRank,RegionName,RegionType,StateName,2008-02-29,2008-03-31,2008-04-30,2008-05-31,2008-06-30,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
9,394347,9,"Atlanta, GA",msa,GA,3750.0,4167.0,4572.0,4520.0,4916.0,...,6804.0,6745.0,9597.0,8917.0,9330.0,9344.0,7929.0,7975.0,6915.0,7230.0

In [9]:
#pulling out list price for Atlanta
atl_list_price = list_price.loc[list_price['RegionName']=='Atlanta, GA']
atl_list_price

,RegionID,SizeRank,RegionName,RegionType,StateName,2018-03-31,2018-04-30,2018-05-31,2018-06-30,2018-07-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
9,394347,9,"Atlanta, GA",msa,GA,280600.0,289900.0,296600.0,299633.0,297000.0,...,345633.0,345667.0,351633.0,362633.0,375933.0,387948.0,391915.0,388582.0,381600.0,376600.0

In [10]:
#inventory for Atlanta
atl_inventory = inventory.loc[inventory['RegionName']=='Atlanta, GA']
atl_inventory

,RegionID,SizeRank,RegionName,RegionType,StateName,2018-03-31,2018-04-30,2018-05-31,2018-06-30,2018-07-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
9,394347,9,"Atlanta, GA",msa,GA,25097.0,26357.0,27888.0,29198.0,30516.0,...,16811.0,15848.0,16466.0,17144.0,18526.0,20072.0,21957.0,23546.0,24055.0,23799.0

In [11]:
#Atlanta sales count melt
atl_sales_count = pd.melt(atl_sales_count, id_vars=['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = 'sales_count' )
atl_sales_count.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,date,sales_count
0,394347,9,"Atlanta, GA",msa,GA,2008-02-29,3750.0
1,394347,9,"Atlanta, GA",msa,GA,2008-03-31,4167.0
2,394347,9,"Atlanta, GA",msa,GA,2008-04-30,4572.0
3,394347,9,"Atlanta, GA",msa,GA,2008-05-31,4520.0
4,394347,9,"Atlanta, GA",msa,GA,2008-06-30,4916.0

In [12]:
#converting sales count date to datetime
atl_sales_count['date']= pd.to_datetime(atl_sales_count['date'])
atl_sales_count.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 177 entries, 0 to 176
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   RegionID     177 non-null    int64
 1   SizeRank     177 non-null    int64
 2   RegionName   177 non-null    object
 3   RegionType   177 non-null    object
 4   StateName    177 non-null    object
 5   date         177 non-null    datetime64[ns]
 6   sales_count  177 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(3)
memory usage: 9.8+ KB

In [13]:
#adjusting time to match other dateframes starting at 2018-03-31
atl_sales_count = atl_sales_count.loc[atl_sales_count['date']>='2018-03-31']
atl_sales_count = atl_sales_count.reset_index(drop=True)
atl_sales_count = atl_sales_count.rename(columns = {'RegionName':'City','StateName':'State'})
atl_sales_count.head()

   RegionID  SizeRank         City RegionType State       date  sales_count
0    394347         9  Atlanta, GA        msa    GA 2018-03-31       9093.0
1    394347         9  Atlanta, GA        msa    GA 2018-04-30       9374.0
2    394347         9  Atlanta, GA        msa    GA 2018-05-31      10845.0
3    394347         9  Atlanta, GA        msa    GA 2018-06-30      10787.0
4    394347         9  Atlanta, GA        msa    GA 2018-07-31      10211.0

In [14]:
#Atlanta list price melt
atl_list_price = pd.melt(atl_list_price, id_vars=['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = 'avg_list_price' )
atl_list_price.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,date,avg_list_price
0,394347,9,"Atlanta, GA",msa,GA,2018-03-31,280600.0
1,394347,9,"Atlanta, GA",msa,GA,2018-04-30,289900.0
2,394347,9,"Atlanta, GA",msa,GA,2018-05-31,296600.0
3,394347,9,"Atlanta, GA",msa,GA,2018-06-30,299633.0
4,394347,9,"Atlanta, GA",msa,GA,2018-07-31,297000.0

In [15]:
atl_list_price = atl_list_price.rename(columns = {'RegionName':'City','StateName':'State'})
atl_list_price.head()

,RegionID,SizeRank,City,RegionType,State,date,avg_list_price
0,394347,9,"Atlanta, GA",msa,GA,2018-03-31,280600.0
1,394347,9,"Atlanta, GA",msa,GA,2018-04-30,289900.0
2,394347,9,"Atlanta, GA",msa,GA,2018-05-31,296600.0
3,394347,9,"Atlanta, GA",msa,GA,2018-06-30,299633.0
4,394347,9,"Atlanta, GA",msa,GA,2018-07-31,297000.0

In [16]:
#Atlanta inventory melt
atl_inventory = pd.melt(atl_inventory, id_vars=['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = 'inventory_count' )

In [17]:
atl_inventory = atl_inventory.rename(columns = {'RegionName':'City','StateName':'State'})
atl_inventory.head()

,RegionID,SizeRank,City,RegionType,State,date,inventory_count
0,394347,9,"Atlanta, GA",msa,GA,2018-03-31,25097.0
1,394347,9,"Atlanta, GA",msa,GA,2018-04-30,26357.0
2,394347,9,"Atlanta, GA",msa,GA,2018-05-31,27888.0
3,394347,9,"Atlanta, GA",msa,GA,2018-06-30,29198.0
4,394347,9,"Atlanta, GA",msa,GA,2018-07-31,30516.0

In [18]:
#All sales count melt
sales_count = pd.melt(sales_count, id_vars=['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = 'sales_count' )

In [19]:
sales_count = sales_count.rename(columns = {'RegionName':'City','StateName':'State'})
sales_count.head()

,RegionID,SizeRank,City,RegionType,State,date,sales_count
0,102001,0,United States,country,NaN,2008-02-29,152555.0
1,394913,1,"New York, NY",msa,NY,2008-02-29,7435.0
2,753899,2,"Los Angeles, CA",msa,CA,2008-02-29,3263.0
3,394463,3,"Chicago, IL",msa,IL,2008-02-29,3871.0
4,394514,4,"Dallas, TX",msa,TX,2008-02-29,4496.0

In [20]:
sales_count.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16638 entries, 0 to 16637
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   RegionID     16638 non-null  int64
 1   SizeRank     16638 non-null  int64
 2   City         16638 non-null  object
 3   RegionType   16638 non-null  object
 4   State        16461 non-null  object
 5   date         16638 non-null  object
 6   sales_count  16608 non-null  float64
dtypes: float64(1), int64(2), object(4)
memory usage: 910.0+ KB

In [21]:
#all sales count convert date column to datetime
sales_count['date'] = pd.to_datetime(sales_count['date'])

In [22]:
sales_count.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16638 entries, 0 to 16637
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   RegionID     16638 non-null  int64
 1   SizeRank     16638 non-null  int64
 2   City         16638 non-null  object
 3   RegionType   16638 non-null  object
 4   State        16461 non-null  object
 5   date         16638 non-null  datetime64[ns]
 6   sales_count  16608 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(3)
memory usage: 910.0+ KB

In [23]:
#Start date to match the other dataframes at 2018-03-31
sales_count = sales_count.loc[sales_count['date'] >= '2018-03-31']
sales_count = sales_count.reset_index(drop=True)
sales_count.head()

,RegionID,SizeRank,City,RegionType,State,date,sales_count
0,102001,0,United States,country,NaN,2018-03-31,334707.0
1,394913,1,"New York, NY",msa,NY,2018-03-31,12199.0
2,753899,2,"Los Angeles, CA",msa,CA,2018-03-31,9050.0
3,394463,3,"Chicago, IL",msa,IL,2018-03-31,9051.0
4,394514,4,"Dallas, TX",msa,TX,2018-03-31,7493.0

In [24]:
#all list price melt
list_price = pd.melt(list_price, id_vars=['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = 'avg_list_price' )

In [25]:
list_price = list_price.rename(columns = {'RegionName':'City','StateName':'State'})
list_price.head()

,RegionID,SizeRank,City,RegionType,State,date,avg_list_price
0,102001,0,United States,country,NaN,2018-03-31,263267.0
1,394913,1,"New York, NY",msa,NY,2018-03-31,503000.0
2,753899,2,"Los Angeles, CA",msa,CA,2018-03-31,721333.0
3,394463,3,"Chicago, IL",msa,IL,2018-03-31,284600.0
4,394514,4,"Dallas, TX",msa,TX,2018-03-31,322997.0

In [26]:
#all inventory melt
inventory = pd.melt(inventory, id_vars=['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = 'inventory_count' )

In [27]:
inventory= inventory.rename(columns = {'RegionName':'City','StateName':'State'})
inventory.head()

,RegionID,SizeRank,City,RegionType,State,date,inventory_count
0,102001,0,United States,country,NaN,2018-03-31,1424090.0
1,394913,1,"New York, NY",msa,NY,2018-03-31,73707.0
2,753899,2,"Los Angeles, CA",msa,CA,2018-03-31,21998.0
3,394463,3,"Chicago, IL",msa,IL,2018-03-31,38581.0
4,394514,4,"Dallas, TX",msa,TX,2018-03-31,24043.0

In [28]:
#Nashville sales count table DF
nash_sales_count = sales_count.loc[sales_count['City']== 'Nashville, TN']
nash_sales_count = nash_sales_count.reset_index(drop = True)
nash_sales_count.head()

   RegionID  SizeRank           City RegionType State       date  sales_count
0    394902        36  Nashville, TN        msa    TN 2018-03-31       2760.0
1    394902        36  Nashville, TN        msa    TN 2018-04-30       3104.0
2    394902        36  Nashville, TN        msa    TN 2018-05-31       3441.0
3    394902        36  Nashville, TN        msa    TN 2018-06-30       3503.0
4    394902        36  Nashville, TN        msa    TN 2018-07-31       3353.0

In [29]:
#Nashville list price DF
nash_list_price = list_price.loc[list_price['City']== 'Nashville, TN']
nash_list_price = nash_list_price.reset_index(drop=True)
nash_list_price.head()

,RegionID,SizeRank,City,RegionType,State,date,avg_list_price
0,394902,36,"Nashville, TN",msa,TN,2018-03-31,327633.0
1,394902,36,"Nashville, TN",msa,TN,2018-04-30,332933.0
2,394902,36,"Nashville, TN",msa,TN,2018-05-31,334933.0
3,394902,36,"Nashville, TN",msa,TN,2018-06-30,336600.0
4,394902,36,"Nashville, TN",msa,TN,2018-07-31,333267.0

In [30]:
#Nashville inventory DF
nash_inventory = inventory.loc[inventory['City']=='Nashville, TN']
nash_inventory = nash_inventory.reset_index(drop=True)
nash_inventory.head()

,RegionID,SizeRank,City,RegionType,State,date,inventory_count
0,394902,36,"Nashville, TN",msa,TN,2018-03-31,6837.0
1,394902,36,"Nashville, TN",msa,TN,2018-04-30,7421.0
2,394902,36,"Nashville, TN",msa,TN,2018-05-31,8141.0
3,394902,36,"Nashville, TN",msa,TN,2018-06-30,8739.0
4,394902,36,"Nashville, TN",msa,TN,2018-07-31,9184.0

In [31]:
austin_sales_count = sales_count.loc[sales_count['City']=='Austin, TX']
austin_sales_count = austin_sales_count.reset_index(drop=True)
austin_sales_count.head()

   RegionID  SizeRank        City RegionType State       date  sales_count
0    394355        29  Austin, TX        msa    TX 2018-03-31       2297.0
1    394355        29  Austin, TX        msa    TX 2018-04-30       2449.0
2    394355        29  Austin, TX        msa    TX 2018-05-31       2969.0
3    394355        29  Austin, TX        msa    TX 2018-06-30       3019.0
4    394355        29  Austin, TX        msa    TX 2018-07-31       2958.0

In [32]:
austin_list_price = list_price.loc[list_price['City']=='Austin, TX']
austin_list_price = austin_list_price.reset_index(drop=True)
austin_list_price.head()

   RegionID  SizeRank        City RegionType State        date  avg_list_price
0    394355        29  Austin, TX        msa    TX  2018-03-31        362567.0
1    394355        29  Austin, TX        msa    TX  2018-04-30        367600.0
2    394355        29  Austin, TX        msa    TX  2018-05-31        370717.0
3    394355        29  Austin, TX        msa    TX  2018-06-30        372084.0
4    394355        29  Austin, TX        msa    TX  2018-07-31        371751.0

In [33]:
austin_inventory = inventory.loc[inventory['City']=='Austin, TX']
austin_inventory = austin_inventory.reset_index(drop=True)
austin_inventory.head()

,RegionID,SizeRank,City,RegionType,State,date,inventory_count
0,394355,29,"Austin, TX",msa,TX,2018-03-31,7392.0
1,394355,29,"Austin, TX",msa,TX,2018-04-30,8277.0
2,394355,29,"Austin, TX",msa,TX,2018-05-31,9243.0
3,394355,29,"Austin, TX",msa,TX,2018-06-30,9920.0
4,394355,29,"Austin, TX",msa,TX,2018-07-31,10287.0

In [34]:
#forecasting csv
forecast = pd.read_csv('../data/zillow_forecasts.csv')

In [35]:
forecast.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,BaseDate,2022-11-30,2023-01-31,2023-10-31
0,102001,0,United States,country,NaN,2022-10-31,0.2,0.4,1.2
1,394913,1,"New York, NY",msa,NY,2022-10-31,0.1,-0.1,-1.4
2,753899,2,"Los Angeles, CA",msa,CA,2022-10-31,-0.1,-0.8,-1.8
3,394463,3,"Chicago, IL",msa,IL,2022-10-31,0.3,0.3,-1.4
4,394514,4,"Dallas, TX",msa,TX,2022-10-31,0.3,0.6,2.2

In [36]:
#dropping irrelevant date
forecast = forecast.drop('2022-11-30', axis=1)
forecast.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,BaseDate,2023-01-31,2023-10-31
0,102001,0,United States,country,NaN,2022-10-31,0.4,1.2
1,394913,1,"New York, NY",msa,NY,2022-10-31,-0.1,-1.4
2,753899,2,"Los Angeles, CA",msa,CA,2022-10-31,-0.8,-1.8
3,394463,3,"Chicago, IL",msa,IL,2022-10-31,0.3,-1.4
4,394514,4,"Dallas, TX",msa,TX,2022-10-31,0.6,2.2

In [37]:
#forecast melt
forecast = pd.melt(forecast, id_vars = ['RegionID','SizeRank','RegionName','RegionType','StateName', 'BaseDate'], var_name = 'proj_date', value_name = 'proj_value')

In [38]:
forecast = forecast.rename(columns = {'RegionName':'City','StateName':'State'})
forecast.head()

,RegionID,SizeRank,City,RegionType,State,BaseDate,proj_date,proj_value
0,102001,0,United States,country,NaN,2022-10-31,2023-01-31,0.4
1,394913,1,"New York, NY",msa,NY,2022-10-31,2023-01-31,-0.1
2,753899,2,"Los Angeles, CA",msa,CA,2022-10-31,2023-01-31,-0.8
3,394463,3,"Chicago, IL",msa,IL,2022-10-31,2023-01-31,0.3
4,394514,4,"Dallas, TX",msa,TX,2022-10-31,2023-01-31,0.6

In [39]:
#Atlanta forecast
atl_forecast = forecast.loc[forecast['City']=='Atlanta, GA']
atl_forecast = atl_forecast.reset_index(drop=True)
atl_forecast

,RegionID,SizeRank,City,RegionType,State,BaseDate,proj_date,proj_value
0,394347,9,"Atlanta, GA",msa,GA,2022-10-31,2023-01-31,-0.1
1,394347,9,"Atlanta, GA",msa,GA,2022-10-31,2023-10-31,2.6

In [40]:
#Nashville forecast
nash_forecast = forecast.loc[forecast['City']=='Nashville, TN']
nash_forecast = nash_forecast.reset_index(drop=True)
nash_forecast

,RegionID,SizeRank,City,RegionType,State,BaseDate,proj_date,proj_value
0,394902,36,"Nashville, TN",msa,TN,2022-10-31,2023-01-31,-0.7
1,394902,36,"Nashville, TN",msa,TN,2022-10-31,2023-10-31,1.3

In [41]:
#Austin forecast
austin_forecast = forecast.loc[forecast['City']=='Austin, TX']
austin_forecast = austin_forecast.reset_index(drop=True)
austin_forecast

,RegionID,SizeRank,City,RegionType,State,BaseDate,proj_date,proj_value
0,394355,29,"Austin, TX",msa,TX,2022-10-31,2023-01-31,-2.7
1,394355,29,"Austin, TX",msa,TX,2022-10-31,2023-10-31,-0.4

In [42]:
#one bedroom value DF
one_bed_value = pd.read_csv('../data/one_bedroom_value.csv')
one_bed_value.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,85081.0,85364.0,85673.0,86303.0,86925.0,...,230766.0,234229.0,237816.0,241563.0,245093.0,248123.0,250154.0,251278.0,251887.0,252472.0
1,394913,1,"New York, NY",msa,NY,160659.0,161685.0,162526.0,164236.0,165873.0,...,432570.0,434887.0,438854.0,443229.0,447675.0,451303.0,454315.0,456246.0,457128.0,457673.0
2,753899,2,"Los Angeles, CA",msa,CA,134285.0,134850.0,135697.0,137275.0,138974.0,...,515782.0,521743.0,530541.0,539905.0,548374.0,549021.0,548602.0,541662.0,537058.0,531931.0
3,394463,3,"Chicago, IL",msa,IL,110652.0,110920.0,111443.0,112441.0,113578.0,...,183172.0,184089.0,185392.0,186510.0,188089.0,189455.0,190474.0,190836.0,191213.0,191646.0
4,394514,4,"Dallas, TX",msa,TX,76498.0,76688.0,76268.0,75856.0,75731.0,...,169588.0,172874.0,175890.0,180084.0,183450.0,186817.0,187776.0,188265.0,185284.0,182623.0

In [43]:
#one bed melt
one_bed_value = pd.melt(one_bed_value, id_vars = ['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = 'home_value')

In [44]:
one_bed_value = one_bed_value.rename(columns = {'RegionName':'City','StateName':'State', 'home_value': '1br_value'})
one_bed_value.head()

   RegionID  SizeRank             City RegionType State        date  1br_value
0    102001         0    United States    country   NaN  2000-01-31    85081.0
1    394913         1     New York, NY        msa    NY  2000-01-31   160659.0
2    753899         2  Los Angeles, CA        msa    CA  2000-01-31   134285.0
3    394463         3      Chicago, IL        msa    IL  2000-01-31   110652.0
4    394514         4       Dallas, TX        msa    TX  2000-01-31    76498.0

In [45]:
one_bed_value['date']= pd.to_datetime(one_bed_value['date'])
one_bed_value = one_bed_value.loc[one_bed_value['date']>='2018-03-31']

In [46]:
#Atlanta one bed value
atl_one_bed = one_bed_value.loc[one_bed_value['City']=='Atlanta, GA']
atl_one_bed = atl_one_bed.reset_index(drop=True)
atl_one_bed.head()

   RegionID  SizeRank         City RegionType State       date  1br_value
0    394347         9  Atlanta, GA        msa    GA 2018-03-31   176725.0
1    394347         9  Atlanta, GA        msa    GA 2018-04-30   177972.0
2    394347         9  Atlanta, GA        msa    GA 2018-05-31   179748.0
3    394347         9  Atlanta, GA        msa    GA 2018-06-30   181273.0
4    394347         9  Atlanta, GA        msa    GA 2018-07-31   182844.0

In [47]:
#Nashville one bed value
nash_one_bed = one_bed_value.loc[one_bed_value['City']=='Nashville, TN']
nash_one_bed = nash_one_bed.reset_index(drop=True)
nash_one_bed.head()

   RegionID  SizeRank           City RegionType State       date  1br_value
0    394902        36  Nashville, TN        msa    TN 2018-03-31   230639.0
1    394902        36  Nashville, TN        msa    TN 2018-04-30   230505.0
2    394902        36  Nashville, TN        msa    TN 2018-05-31   230903.0
3    394902        36  Nashville, TN        msa    TN 2018-06-30   231154.0
4    394902        36  Nashville, TN        msa    TN 2018-07-31   231726.0

In [48]:
#Austin one bed value
austin_one_bed = one_bed_value.loc[one_bed_value['City']=='Austin, TX']
austin_one_bed = austin_one_bed.reset_index(drop=True)
austin_one_bed.head()

   RegionID  SizeRank        City RegionType State       date  1br_value
0    394355        29  Austin, TX        msa    TX 2018-03-31   249069.0
1    394355        29  Austin, TX        msa    TX 2018-04-30   249340.0
2    394355        29  Austin, TX        msa    TX 2018-05-31   249668.0
3    394355        29  Austin, TX        msa    TX 2018-06-30   250820.0
4    394355        29  Austin, TX        msa    TX 2018-07-31   252084.0

In [49]:
#two bedroom value DF
two_bed_value = pd.read_csv('../data/two_bedroom_value.csv')
two_bed_value.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,93964.0,94226.0,94500.0,95064.0,95631.0,...,243911.0,247843.0,251923.0,256190.0,260130.0,263433.0,265497.0,266606.0,267184.0,267821.0
1,394913,1,"New York, NY",msa,NY,161936.0,162774.0,163480.0,164947.0,166399.0,...,401540.0,405145.0,409802.0,414772.0,419988.0,424506.0,428245.0,430330.0,431353.0,431933.0
2,753899,2,"Los Angeles, CA",msa,CA,179927.0,180419.0,181331.0,183050.0,184982.0,...,685711.0,694066.0,706878.0,721499.0,734273.0,735225.0,733400.0,722761.0,715473.0,708287.0
3,394463,3,"Chicago, IL",msa,IL,126267.0,126506.0,126897.0,127632.0,128390.0,...,219278.0,221225.0,223701.0,226319.0,229397.0,231765.0,233264.0,233609.0,233985.0,234542.0
4,394514,4,"Dallas, TX",msa,TX,84480.0,84533.0,84507.0,84601.0,84732.0,...,224550.0,229765.0,234886.0,240547.0,245437.0,249785.0,251000.0,250994.0,248714.0,248115.0

In [50]:
#three bedroom value DF
three_bed_value = pd.read_csv('../data/three_bedroom_value.csv')
three_bed_value.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,118923.0,119230.0,119548.0,120197.0,120850.0,...,301711.0,306563.0,311466.0,316596.0,321247.0,325119.0,327368.0,328391.0,328772.0,329286.0
1,394913,1,"New York, NY",msa,NY,200153.0,201312.0,202366.0,204453.0,206416.0,...,518847.0,523541.0,529764.0,536306.0,543203.0,548843.0,553294.0,555372.0,556365.0,556637.0
2,753899,2,"Los Angeles, CA",msa,CA,218383.0,219075.0,220219.0,222371.0,224740.0,...,839317.0,851164.0,867833.0,886248.0,901837.0,902755.0,898995.0,884803.0,874767.0,865216.0
3,394463,3,"Chicago, IL",msa,IL,145931.0,146223.0,146647.0,147497.0,148429.0,...,276234.0,278725.0,281889.0,285094.0,288827.0,291584.0,293239.0,293399.0,293598.0,294102.0
4,394514,4,"Dallas, TX",msa,TX,106565.0,106661.0,106739.0,106924.0,107101.0,...,299966.0,307338.0,314456.0,322623.0,329960.0,336265.0,338228.0,337463.0,335881.0,335789.0

In [51]:
#four bedroom value DF
four_bed_value = pd.read_csv('../data/four_bedroom_value.csv')
four_bed_value.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,175564.0,176088.0,176634.0,177753.0,178880.0,...,449105.0,456154.0,463525.0,471342.0,478417.0,483924.0,486675.0,487274.0,487157.0,487422.0
1,394913,1,"New York, NY",msa,NY,267636.0,269292.0,270702.0,273614.0,276373.0,...,655065.0,660909.0,668790.0,677547.0,686730.0,694244.0,699824.0,702639.0,703937.0,704305.0
2,753899,2,"Los Angeles, CA",msa,CA,288298.0,289616.0,291170.0,294224.0,297293.0,...,1060530.0,1078578.0,1102929.0,1128559.0,1151427.0,1154801.0,1151241.0,1134622.0,1124317.0,1114248.0
3,394463,3,"Chicago, IL",msa,IL,215112.0,215684.0,216449.0,217892.0,219406.0,...,389249.0,392701.0,397318.0,402475.0,408150.0,412431.0,415056.0,415679.0,416203.0,417270.0
4,394514,4,"Dallas, TX",msa,TX,182888.0,182867.0,182957.0,183113.0,183300.0,...,453748.0,464726.0,474913.0,487500.0,499494.0,509816.0,512248.0,510433.0,508292.0,509150.0

In [52]:
#five bedroom value DF
five_bed_value = pd.read_csv('../data/five_bedroom_value.csv')
five_bed_value.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,240204.0,241054.0,241899.0,243643.0,245420.0,...,637146.0,647483.0,658266.0,669830.0,680131.0,687627.0,690893.0,690941.0,690356.0,690381.0
1,394913,1,"New York, NY",msa,NY,374215.0,376628.0,378716.0,382870.0,386888.0,...,946714.0,955671.0,968114.0,981890.0,996539.0,1008883.0,1018603.0,1024546.0,1027954.0,1029592.0
2,753899,2,"Los Angeles, CA",msa,CA,454793.0,456796.0,459254.0,463957.0,468684.0,...,1582139.0,1609125.0,1645105.0,1683993.0,1719042.0,1726076.0,1724951.0,1705679.0,1695555.0,1680989.0
3,394463,3,"Chicago, IL",msa,IL,302287.0,303048.0,304151.0,306305.0,308488.0,...,526275.0,530721.0,536629.0,543510.0,551382.0,557830.0,562530.0,564526.0,566102.0,568069.0
4,394514,4,"Dallas, TX",msa,TX,277644.0,277490.0,277634.0,277886.0,278258.0,...,655932.0,672622.0,687495.0,706494.0,724860.0,740863.0,743991.0,741058.0,737802.0,739440.0

In [53]:
#two bed melt
two_bed_value = pd.melt(two_bed_value, id_vars = ['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = '2br_value')

In [54]:
#three bed melt
three_bed_value = pd.melt(three_bed_value, id_vars = ['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = '3br_value')

In [55]:
#four bed melt
four_bed_value = pd.melt(four_bed_value, id_vars = ['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = '4br_value')

In [56]:
#five bed melt
five_bed_value = pd.melt(five_bed_value, id_vars = ['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = '5br_value')

In [57]:
two_bed_value = two_bed_value.rename(columns = {'RegionName':'City','StateName':'State'})
two_bed_value['date']= pd.to_datetime(two_bed_value['date'])
two_bed_value = two_bed_value.loc[two_bed_value['date']>='2018-03-31']
two_bed_value.head()

,RegionID,SizeRank,City,RegionType,State,date,2br_value
194020,102001,0,United States,country,NaN,2018-03-31,170426.0
194021,394913,1,"New York, NY",msa,NY,2018-03-31,316669.0
194022,753899,2,"Los Angeles, CA",msa,CA,2018-03-31,518939.0
194023,394463,3,"Chicago, IL",msa,IL,2018-03-31,173622.0
194024,394514,4,"Dallas, TX",msa,TX,2018-03-31,146046.0

In [58]:
three_bed_value = three_bed_value.rename(columns = {'RegionName':'City','StateName':'State'})
three_bed_value['date']= pd.to_datetime(three_bed_value['date'])
three_bed_value = three_bed_value.loc[three_bed_value['date']>='2018-03-31']
three_bed_value.head()

,RegionID,SizeRank,City,RegionType,State,date,3br_value
194674,102001,0,United States,country,NaN,2018-03-31,210264.0
194675,394913,1,"New York, NY",msa,NY,2018-03-31,395889.0
194676,753899,2,"Los Angeles, CA",msa,CA,2018-03-31,616197.0
194677,394463,3,"Chicago, IL",msa,IL,2018-03-31,215377.0
194678,394514,4,"Dallas, TX",msa,TX,2018-03-31,199935.0

In [59]:
four_bed_value = four_bed_value.rename(columns = {'RegionName':'City','StateName':'State'})
four_bed_value['date']= pd.to_datetime(four_bed_value['date'])
four_bed_value = four_bed_value.loc[four_bed_value['date']>='2018-03-31']
four_bed_value.head()

,RegionID,SizeRank,City,RegionType,State,date,4br_value
194456,102001,0,United States,country,NaN,2018-03-31,320834.0
194457,394913,1,"New York, NY",msa,NY,2018-03-31,508145.0
194458,753899,2,"Los Angeles, CA",msa,CA,2018-03-31,776059.0
194459,394463,3,"Chicago, IL",msa,IL,2018-03-31,313818.0
194460,394514,4,"Dallas, TX",msa,TX,2018-03-31,316718.0

In [60]:
five_bed_value = five_bed_value.rename(columns = {'RegionName':'City','StateName':'State'})
five_bed_value['date']= pd.to_datetime(five_bed_value['date'])
five_bed_value = five_bed_value.loc[five_bed_value['date']>='2018-03-31']
five_bed_value.head()

,RegionID,SizeRank,City,RegionType,State,date,5br_value
189224,102001,0,United States,country,NaN,2018-03-31,455757.0
189225,394913,1,"New York, NY",msa,NY,2018-03-31,755353.0
189226,753899,2,"Los Angeles, CA",msa,CA,2018-03-31,1172028.0
189227,394463,3,"Chicago, IL",msa,IL,2018-03-31,436192.0
189228,394514,4,"Dallas, TX",msa,TX,2018-03-31,459735.0

In [61]:
#Atlanta two bed value
atl_two_bed = two_bed_value.loc[two_bed_value['City']=='Atlanta, GA']
atl_two_bed = atl_two_bed.reset_index(drop=True)
atl_two_bed.head()

   RegionID  SizeRank         City RegionType State       date  2br_value
0    394347         9  Atlanta, GA        msa    GA 2018-03-31   157521.0
1    394347         9  Atlanta, GA        msa    GA 2018-04-30   158939.0
2    394347         9  Atlanta, GA        msa    GA 2018-05-31   160431.0
3    394347         9  Atlanta, GA        msa    GA 2018-06-30   162088.0
4    394347         9  Atlanta, GA        msa    GA 2018-07-31   163847.0

In [62]:
#Atlanta three bed value
atl_three_bed = three_bed_value.loc[three_bed_value['City']=='Atlanta, GA']
atl_three_bed = atl_three_bed.reset_index(drop=True)
atl_three_bed.head()

   RegionID  SizeRank         City RegionType State       date  3br_value
0    394347         9  Atlanta, GA        msa    GA 2018-03-31   177286.0
1    394347         9  Atlanta, GA        msa    GA 2018-04-30   178554.0
2    394347         9  Atlanta, GA        msa    GA 2018-05-31   179812.0
3    394347         9  Atlanta, GA        msa    GA 2018-06-30   181297.0
4    394347         9  Atlanta, GA        msa    GA 2018-07-31   182876.0

In [63]:
#Atlanta four bed value
atl_four_bed = four_bed_value.loc[four_bed_value['City']=='Atlanta, GA']
atl_four_bed = atl_four_bed.reset_index(drop=True)
atl_four_bed.head()

   RegionID  SizeRank         City RegionType State       date  4br_value
0    394347         9  Atlanta, GA        msa    GA 2018-03-31   264695.0
1    394347         9  Atlanta, GA        msa    GA 2018-04-30   266072.0
2    394347         9  Atlanta, GA        msa    GA 2018-05-31   267312.0
3    394347         9  Atlanta, GA        msa    GA 2018-06-30   268619.0
4    394347         9  Atlanta, GA        msa    GA 2018-07-31   269901.0

In [64]:
#Atlanta five bed value
atl_five_bed = five_bed_value.loc[five_bed_value['City']=='Atlanta, GA']
atl_five_bed = atl_five_bed.reset_index(drop=True)
atl_five_bed.head()

   RegionID  SizeRank         City RegionType State       date  5br_value
0    394347         9  Atlanta, GA        msa    GA 2018-03-31   391588.0
1    394347         9  Atlanta, GA        msa    GA 2018-04-30   393007.0
2    394347         9  Atlanta, GA        msa    GA 2018-05-31   394146.0
3    394347         9  Atlanta, GA        msa    GA 2018-06-30   395010.0
4    394347         9  Atlanta, GA        msa    GA 2018-07-31   395991.0

In [65]:
#Nashville two bed value
nash_two_bed = two_bed_value.loc[two_bed_value['City']=='Nashville, TN']
nash_two_bed = nash_two_bed.reset_index(drop=True)
nash_two_bed.head()

   RegionID  SizeRank           City RegionType State       date  2br_value
0    394902        36  Nashville, TN        msa    TN 2018-03-31   203381.0
1    394902        36  Nashville, TN        msa    TN 2018-04-30   204211.0
2    394902        36  Nashville, TN        msa    TN 2018-05-31   204827.0
3    394902        36  Nashville, TN        msa    TN 2018-06-30   205509.0
4    394902        36  Nashville, TN        msa    TN 2018-07-31   206531.0

In [66]:
#Nashville three bed value
nash_three_bed = three_bed_value.loc[three_bed_value['City']=='Nashville, TN']
nash_three_bed = nash_three_bed.reset_index(drop=True)
nash_three_bed.head()

   RegionID  SizeRank           City RegionType State       date  3br_value
0    394902        36  Nashville, TN        msa    TN 2018-03-31   249786.0
1    394902        36  Nashville, TN        msa    TN 2018-04-30   251126.0
2    394902        36  Nashville, TN        msa    TN 2018-05-31   251988.0
3    394902        36  Nashville, TN        msa    TN 2018-06-30   252978.0
4    394902        36  Nashville, TN        msa    TN 2018-07-31   254214.0

In [67]:
#Nashville four bed value
nash_four_bed = four_bed_value.loc[four_bed_value['City']=='Nashville, TN']
nash_four_bed = nash_four_bed.reset_index(drop=True)
nash_four_bed.head()

   RegionID  SizeRank           City RegionType State       date  4br_value
0    394902        36  Nashville, TN        msa    TN 2018-03-31   378968.0
1    394902        36  Nashville, TN        msa    TN 2018-04-30   380312.0
2    394902        36  Nashville, TN        msa    TN 2018-05-31   380664.0
3    394902        36  Nashville, TN        msa    TN 2018-06-30   381418.0
4    394902        36  Nashville, TN        msa    TN 2018-07-31   382393.0

In [68]:
#Nashville five bed value
nash_five_bed = five_bed_value.loc[five_bed_value['City']=='Nashville, TN']
nash_five_bed = nash_five_bed.reset_index(drop=True)
nash_five_bed.head()

   RegionID  SizeRank           City RegionType State       date  5br_value
0    394902        36  Nashville, TN        msa    TN 2018-03-31   535710.0
1    394902        36  Nashville, TN        msa    TN 2018-04-30   537365.0
2    394902        36  Nashville, TN        msa    TN 2018-05-31   537536.0
3    394902        36  Nashville, TN        msa    TN 2018-06-30   538261.0
4    394902        36  Nashville, TN        msa    TN 2018-07-31   539195.0

In [69]:
#Austin two bed value
austin_two_bed = two_bed_value.loc[two_bed_value['City']=='Austin, TX']
austin_two_bed = austin_two_bed.reset_index(drop=True)
austin_two_bed.head()

   RegionID  SizeRank        City RegionType State       date  2br_value
0    394355        29  Austin, TX        msa    TX 2018-03-31   289573.0
1    394355        29  Austin, TX        msa    TX 2018-04-30   290119.0
2    394355        29  Austin, TX        msa    TX 2018-05-31   290867.0
3    394355        29  Austin, TX        msa    TX 2018-06-30   292314.0
4    394355        29  Austin, TX        msa    TX 2018-07-31   293744.0

In [70]:
#Austin three bed value
austin_three_bed = three_bed_value.loc[three_bed_value['City']=='Austin, TX']
austin_three_bed = austin_three_bed.reset_index(drop=True)
austin_three_bed.head()

   RegionID  SizeRank        City RegionType State       date  3br_value
0    394355        29  Austin, TX        msa    TX 2018-03-31   272826.0
1    394355        29  Austin, TX        msa    TX 2018-04-30   273211.0
2    394355        29  Austin, TX        msa    TX 2018-05-31   273754.0
3    394355        29  Austin, TX        msa    TX 2018-06-30   274735.0
4    394355        29  Austin, TX        msa    TX 2018-07-31   275743.0

In [71]:
#Austin four bed value
austin_four_bed = four_bed_value.loc[four_bed_value['City']=='Austin, TX']
austin_four_bed = austin_four_bed.reset_index(drop=True)
austin_four_bed.head()

   RegionID  SizeRank        City RegionType State       date  4br_value
0    394355        29  Austin, TX        msa    TX 2018-03-31   353235.0
1    394355        29  Austin, TX        msa    TX 2018-04-30   353385.0
2    394355        29  Austin, TX        msa    TX 2018-05-31   353632.0
3    394355        29  Austin, TX        msa    TX 2018-06-30   354358.0
4    394355        29  Austin, TX        msa    TX 2018-07-31   355140.0

In [72]:
#Austin five bed value
austin_five_bed = five_bed_value.loc[five_bed_value['City']=='Austin, TX']
austin_five_bed = austin_five_bed.reset_index(drop=True)
austin_five_bed.head()

   RegionID  SizeRank        City RegionType State       date  5br_value
0    394355        29  Austin, TX        msa    TX 2018-03-31   509972.0
1    394355        29  Austin, TX        msa    TX 2018-04-30   510362.0
2    394355        29  Austin, TX        msa    TX 2018-05-31   510923.0
3    394355        29  Austin, TX        msa    TX 2018-06-30   512161.0
4    394355        29  Austin, TX        msa    TX 2018-07-31   513876.0

In [76]:
atl_sales_count.to_csv('../data/cleaned/housing/atl_sales_count.csv', index = False)

In [78]:
atl_inventory.to_csv('../data/cleaned/housing/atl_inventory.csv', index = False)

In [79]:
atl_list_price.to_csv('../data/cleaned/housing/atl_list_price.csv', index = False)

In [82]:
atl_forecast.to_csv('../data/cleaned/housing/atl_forecast.csv', index = False)

In [84]:
atl_one_bed.to_csv('../data/cleaned/housing/atl_one_bed.csv', index = False)

In [85]:
atl_two_bed.to_csv('../data/cleaned/housing/atl_two_bed.csv', index = False)

In [86]:
atl_three_bed.to_csv('../data/cleaned/housing/atl_three_bed.csv', index = False)

In [87]:
atl_four_bed.to_csv('../data/cleaned/housing/atl_four_bed.csv', index = False)

In [88]:
atl_five_bed.to_csv('../data/cleaned/housing/atl_five_bed.csv', index = False)

In [89]:
nash_sales_count.to_csv('../data/cleaned/housing/nash_sales_count.csv', index = False)

In [90]:
nash_inventory.to_csv('../data/cleaned/housing/nash_inventory.csv', index = False)

In [91]:
nash_list_price.to_csv('../data/cleaned/housing/nash_list_price.csv', index = False)

In [92]:
nash_forecast.to_csv('../data/cleaned/housing/nash_forecast.csv', index = False)

In [93]:
nash_one_bed.to_csv('../data/cleaned/housing/nash_one_bed.csv', index = False)

In [94]:
nash_two_bed.to_csv('../data/cleaned/housing/nash_two_bed.csv', index = False)

In [95]:
nash_three_bed.to_csv('../data/cleaned/housing/nash_three_bed.csv', index = False)

In [96]:
nash_four_bed.to_csv('../data/cleaned/housing/nash_four_bed.csv', index = False)

In [97]:
nash_five_bed.to_csv('../data/cleaned/housing/nash_five_bed.csv', index = False)

In [98]:
austin_sales_count.to_csv('../data/cleaned/housing/austin_sales_count.csv', index = False)

In [99]:
austin_inventory.to_csv('../data/cleaned/housing/austin_inventory.csv', index = False)

In [100]:
austin_list_price.to_csv('../data/cleaned/housing/austin_list_price.csv', index = False)

In [101]:
austin_forecast.to_csv('../data/cleaned/housing/austin_forecast.csv', index = False)

In [102]:
austin_one_bed.to_csv('../data/cleaned/housing/austin_one_bed.csv', index = False)

In [103]:
austin_two_bed.to_csv('../data/cleaned/housing/austin_two_bed.csv', index = False)

In [104]:
austin_three_bed.to_csv('../data/cleaned/housing/austin_three_bed.csv', index = False)

In [105]:
austin_four_bed.to_csv('../data/cleaned/housing/austin_four_bed.csv', index = False)

In [106]:
austin_five_bed.to_csv('../data/cleaned/housing/austin_five_bed.csv', index = False)